{
    "info": {
        "intro" : "## FOPH Covid19-Data-Explorer\nThe Federal Office of Public Health FOPH compiles a large dataset of Covid19 data from various sources. The FOPH presents this data in a commented [Dashboard](https://www.covid19.admin.ch/de/overview). The source data for this dashboard is published on its own API site accessible e.g. through the index https://www.covid19.admin.ch/api/data/context. The weekly data is also publised as opendata on [opendata.swiss.ch](https://opendata.swiss/de/dataset/covid-19-schweiz). The FOPH Covid-19 dataset is very extensive and the usual initial approach for exploring such a dataset consisting of downloading the data, viewing and filtering it using a tools such as MS Excel and eventually plotting the extracted data is time consuming. The current app facilitates the exploration of the dataset by providing several tools allowing to quickly preview and plot the data by parameter or canton and then download only the required data.\n\nIn addition to the purely data exploration, the tools als provides two analysis based on selected datafile:\n- calculation of ratios for hospitalisation/cases, deaths/cases, deaths/hospitalisations etc.\n- statistics and graphical analysis of cases, hospitalisations, icu-hospitalisations and deaths per wave.\n\nAdditional ressources:\n- FOPH [data documentation](https://www.covid19.admin.ch/api/data/documentation/)"
    },
    "explore": {},
    "ratio": {
        "method":"The timeline for the ratio {}/{} allows to verify, if over time, fewer people require hospitalisation or die for a given number of infections. The desired trend is therefore towards a lower ratio. Such a trend may be influenced by better treatment techniques, less aggressive variants, more vaccinated people, more infections in age classes reacting less less severely to the virus or any combination of these. An increase in ratio may indicate the spread of more aggressive variants or the shift in infections towards more vulnerable groups.\n\nSince the transition from infection to hospitalization and - in the worst case - from hospitalization to death requires time, nominator and denominator groups are taken from different time intervals separated by a time lag. As described in a study by [Faes, C. et al.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7589278/), the time between symptoms onset and hospitalization lies approximately between 3 and 10.4 days, the time from hospitalization to death between 5.7 to 12.1 days. The durations highly depend on the patient's age and preconditions, which are not available in the used daily dataset. The results must be considered with extreme care. However, the user may calculate various scenarios based on different time lags. The most plausible time lag is the one causing less variation in the calculated ratios.\n\n When plotting the ratios, you may generate one chart per canton by selecting the `group by canton` option. In this mode, you may also define a rolling average window, which adds a smoothed red line to the chart, allowing to better distinct trends. The individual ratios are still shown as blue points. Setting the rolling average window to zero will remove the smoothed line. In the grouped mode, the y axis maximum can be set to a constant value, simplifying the comparison of the charts.",
        "interpretation":"The timeline for ratios shows a high variability for most cantons. Several factors may be responsible for this unexpected behavior. First, the assumption of a constant time lag between first symptoms and hospitalization poorly reflects the actual time lag. Time lags may vary considerably, depending on the patient's age and preconditions. Also, some hospital entry data are missing for patients in long-term care, as they often stay in their current facility and are not counted as new hospital entries. However, they are counted as laboratory-confirmed cases and therefore increase the ratio cases/hospitalizations. Cantons with many hospital beds accept patients from cantons or other countries where hospital capacity is exceeded. Except for the laboratory-confirmed cases dataset, the origin of patients (e.g., hospitalized or deceased) is not available. For this reason, ratio cases/hospitalizations increase artificially for receiving cantons and decrease for cantons, forwarding their patients. This effect attenuates with larger cantons or with the CH-dataset. In general, as can be observed when filtering the data for CH, an overall tendency towards higher cases/hospitalizations ratios can be observed over time. This tendency seems to accelerate starting in April 2021."
    },
    "wave": {
        "method":"Pandemics typically evolve as series of waves. We expect the waves to decrease in intensity over time as more people become immune either by vaccination or infection and as better treatments are found. This menu item allows comparing indicators of wave data statistically and graphically. Each wave is defined with a start and end date. The default dates were selected visually from the cases-time series diagram. Depending on the canton of interest, you might want to change the default dates. Statistical comparison calculates the sum and daily mean of cases (entries) and the duration of all selected waves and all selected cantons. If no cantons or waves are selected, then the values for all cantons and all waves will be displayed.\n\nThe graphical comparison plots the number of days since the start of the waves on the x-axis instead of the actual date. This way, the waves become directly superposed and are easier to compare. When selecting `canton` in the `group chars by` option, one plot per selected canton will show with the selected waves as time series lines in each graph. If `wave` is selected in the `group chars by` option, one plot for each wave is displayed, and each plot will show a time-series per selected canton"
    }
}